/* gearcrtif.c                                          */
/********************************************************/
/* object    | ギアシフト情報補正                       */
/* edit his  | 2026/03/02 新規作成                      */
/*           |                                          */
/********************************************************/
/********************************************************/
/* ヘッダーインクルード                                 */
/********************************************************/
#include "../../inc/common.h"     /* 共通ライブラリ         */
#include "../../swift/swtbrgif.h" /* u1g_swift_gear         */
#include "../../conf/gearconf.h"  /* u1g_GEAR_NEUTRAL       */
#include "../gearcrtif.h"         /* I/F公開用ヘッダ        */ 

/********************************************************/
/* 外部公開変数                                         */
/********************************************************/
u1 u1g_gearcrtif_shft; /* ノイズ除去済ギアシフト情報    */
u1 gearcrtif_crtflg    /* ノイズ除去有無状態            */

/********************************************************/
/* 内部公開変数・定数・マクロ                           */
/********************************************************/
static u1 u1s_gearcrt_o; /* ギアシフト情報前回値        */

/********************************************************/
/* 外部公開関数定義                                     */
/********************************************************/

/********************************************************/
/* 関数   | vdg_gearcrtif_pwon()                        */
/* 説明   | ギアシフト情報補正初期化処理                */
/* 引数   | なし                                        */
/* 戻り値 | なし                                        */
/********************************************************/
void
vdg_gearcrtif_pwon( void )
{
    u1 u1t_gearcrt;

    /* pwon時ノイズ除去済ギアシフト情報N設定 */
    u1t_gearcrt = u1g_GEAR_NEUTRAL;

    /* ノイズ除去済みギアシフト情報を公開 */
    u1g_gearcrtif_shft = u1t_gearcrt;

    /* pwon時ノイズ除去有無状態なし設定 */
    u1g_gearcrtif_crtflg = (u1)OFF;

    /* pwon時ギアシフト情報前回値保持 */
    u1s_gearcrt_o = u1t_gearcrt;
}

/********************************************************/
/* 関数   | vdg_gearcrtif_50msm()                       */
/* 説明   | ギアシフト情報補正50msm処理                 */
/* 引数   | なし                                        */
/* 戻り値 | なし                                        */
/********************************************************/
void
dg_gearcrtif_50msm( void )
{
    u1 u1t_gearcrt;
    u1 u1t_crtflg;

    /* swift側のギア情報を取得 */
    u1t_gearcrt = u1g_swift_gear;
    
    /* ギア情報を前回値と比較する */
    u1t_crtflg = (u1)OFF;
    if ( u1t_gearcrt == u1s_gearcrt_o )
    {
        u1g_gearcrtif_shft = u1t_gearcrt;
        u1t_crtflg = (u1)ON;
    }

    /* 補正有無状態を更新 */
    u1g_gearcrtif_crtflg = u1t_crtflg;
    
    /* ギア情報の前回値を保持 */
    u1s_gearcrt_o = u1t_gearcrt;
}

/********************************************************/
/* 内部関数定義                                         */
/********************************************************/

/********************************************************/
/* 関数   | u1 u1g_sample_function( void )              */
/* 説明   | ドライブモード取得関数宣言                  */
/* 引数   | なし                                        */
/* 戻り値 | なし                                        */
/********************************************************/

/********************************************************/
/* EOF                                                  */
/********************************************************/

