/* gearrtoif.h                                          */
/********************************************************/
/* object    | ギア比補正                               */
/* edit his  | 2026/03/03 新規作成 ver1.0               */
/*           |                                          */
/********************************************************/
/********************************************************/
/* ヘッダーインクルード                                 */
/********************************************************/
#include "../../conf/gearconf.h"  /* u1g_GEAR_NEUTRAL,  */
                                  /* u1g_GEAR_MAX       */
#include "../gearcrtif.h"         /* u1g_gearcrtif_shft */
#include "../gearrtoif.h"         /* 自ヘッダ           */ 

/********************************************************/
/* 外部公開変数                                         */
/********************************************************/
u1 u1g_gearrtoif_ratio;      /* ギア比 lsb=10/256, osf=5 */

/********************************************************/
/* 内部公開変数・定数・マクロ                           */
/********************************************************/
#define u1s_GEARRTO_ONE     (u1)(((3.5 + 5)  / (10 / 256)) + 0.5) /* ギア比1 lsb=10/256, osf=5 */
#define u1s_GEARRTO_TWO     (u1)(((2.1 + 5)  / (10 / 256)) + 0.5) /* ギア比2 lsb=10/256, osf=5 */
#define u1s_GEARRTO_THREE   (u1)(((1.4 + 5)  / (10 / 256)) + 0.5) /* ギア比3 lsb=10/256, osf=5 */
#define u1s_GEARRTO_FOUR    (u1)(((1.0 + 5)  / (10 / 256)) + 0.5) /* ギア比4 lsb=10/256, osf=5 */
#define u1s_GEARRTO_FIVE    (u1)(((0.8 + 5)  / (10 / 256)) + 0.5) /* ギア比5 lsb=10/256, osf=5 */
#define u1s_GEARRTO_NEUTRAL (u1)(((0 + 5)    / (10 / 256)) + 0.5) /* ギア比R lsb=10/256, osf=5 */
#define u1s_GEARRTO_REVERSE (u1)(((-3.2 + 5) / (10 / 256)) + 0.5) /* ギア比N lsb=10/256, osf=5 */

/* ギアシフト情報(1-5,N,R)をギア比に変換 */
static const u1 u1s_GEARRTO_TBL[u1g_GEAR_NUM] =
{
    u1s_GEARRTO_ONE,
    u1s_GEARRTO_TWO,
    u1s_GEARRTO_THREE,
    u1s_GEARRTO_FOUR,
    u1s_GEARRTO_FIVE,
    u1s_GEARRTO_NEUTRAL,
    u1s_GEARRTO_REVERSE
};

/********************************************************/
/* 外部公開関数定義                                     */
/********************************************************/
/********************************************************/
/* 関数   | vdg_gearrtoif_pwon()                        */
/* 説明   | ギア比補正初期化処理                        */
/* 引数   | なし                                        */
/* 戻り値 | なし                                        */
/********************************************************/
void
vdg_gearrtoif_pwon( void )
{
    vdg_gearrto_renew();
}

/********************************************************/
/* 関数   | vdg_gearrtoif_50msm()                       */
/* 説明   | ギア比補正50msm処理                         */
/* 引数   | なし                                        */
/* 戻り値 | なし                                        */
/********************************************************/
void
vdg_gearrtoif_50msm( void )
{
    vdg_gearrto_renew();
}

/********************************************************/
/* 内部関数定義                                         */
/********************************************************/
/********************************************************/
/* 関数   | vdg_gearrto_renew()                         */
/* 説明   | ギア比補正更新処理                          */
/* 引数   | なし                                        */
/* 戻り値 | なし                                        */
/********************************************************/
void
vdg_gearrto_renew( void )
{
    u1 u1t_gearcrt; /* 補正済ギアシフト情報 */
    u1 u1t_gearrto; /* ギア比 lsb=10/256, osf=5 */

    /* 50msm時ノイズ除去済ギアシフト情報N取得 */
    u1t_gearcrt = u1g_gearcrtif_shft;

    /* ギアシフト情報をギア比に変換 */
    u1t_gearrto = u1s_GEARRTO_TBL[u1g_GEAR_NEUTRAL];
    if ( u1t_gearcrt <= u1g_GEAR_MAX )
    {
        u1t_gearrto = u1s_GEARRTO_TBL[u1t_gearcrt];
    }

    /* ギア比を公開 */
    u1g_gearrtoif_ratio = u1t_gearrto;
}

/********************************************************/
/* EOF                                                  */
/********************************************************/